tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'jonof/kenutils'

# The absolute basics
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'vim'

# Required by various ruby gems.
brew 'cmake'
brew 'icu4c'
brew 'ctags'
brew 'hub'

# For managing node, much as I'd rather not.
brew 'nodenv'

# For managing my rubies
brew 'rbenv'
brew 'rbenv-aliases'
brew 'rbenv-ctags'

# GnuPG stuff
brew 'pinentry-mac'
brew 'gnupg2'
brew 'gpg-agent'

# Image manipulation (mostly tools for image_optim)
brew 'pngout'
brew 'advancecomp'
brew 'gifsicle'
brew 'jhead'
brew 'jpegoptim'
brew 'jpeg'
brew 'optipng'
brew 'pngcrush'
brew 'pngquant'
